hello-msg =
    <b>👊 مرحباً!</b>
    إذا كنت ترغب في دعم المؤلف بالتبرع، استخدم الأوامر التالية:

    • /donate [المبلغ]: تبرع بعدد معين من النجوم (على سبيل المثال، /donate 100)
    • /paysupport: المساعدة في الدفع
    • /refund: استرداد التبرع

donate-invoice-title =
    تبرع للمؤلف

donate-invoice-description =
    بمبلغ {$amount ->
        [one] {$amount} نجمة
        [few] {$amount} نجوم
       *[other] {$amount} نجمة
    }

donate-button-pay =
    ادفع {$amount} XTR

donate-button-cancel =
    إلغاء العملية

donate-input-error =
    يرجى إدخال المبلغ بالصيغة <code>/donate [رقم]</code>، حيث [رقم] هو مبلغ التبرع من ⭐️ 1 إلى ⭐️ 2500.

    أمثلة:
    • <code>/donate 100</code> - تبرع بـ 100 ⭐️
    • <code>/donate 500</code> - تبرع بـ 500 ⭐️
    • <code>/donate 1000</code> - تبرع بـ 1000 ⭐️

donate-paysupport-tid-tip =
    <blockquote>يمكنك الحصول عليه بعد إتمام التبرع.
    فقط اضغط على الرسالة <b>"لقد نجحت في إرسال ⭐️ .."</b> وانسخ معرف المعاملة من هناك.</blockquote>

donate-paysupport-message =
    إذا كنت ترغب في استرداد التبرع، استخدم الأمر /refund.

    🤓 ستحتاج إلى معرف المعاملة.
    {donate-paysupport-tid-tip}

donate-refund-input-error =
    يرجى تقديم معرف المعاملة بالصيغة <code>/refund [id]</code>، حيث [id] هو معرف المعاملة الذي حصلت عليه بعد التبرع.

    {donate-paysupport-tid-tip}

donate-refund-success =
    تم استرداد التبرع بنجاح. تمت إعادة النجوم إلى حسابك في Telegram.

donate-refund-code-not-found =
    لم يتم العثور على معاملة بالمعرف المحدد. يرجى التحقق من البيانات والمحاولة مرة أخرى.

donate-refund-already-refunded =
    تم استرداد التبرع لهذه المعاملة سابقًا.

donate-cancel-payment =
    😢 تم إلغاء التبرع.

donate-successful-payment =
    <b>🫡 شكراً لك!</b>
    تم قبول تبرعك بنجاح.

payment-none-error =
    خطأ xz

hello-owner =
    <b>👊 مرحباً، مالك الحساب!</b>

ping-msg =
    <b>👊 يعمل بشكل جيد!</b>

media-msg =
    <b>🫡 وسائط رائعة <i>(ربما)</i>!</b>
